In [14]:
import numpy as np
import pandas as pd

In [18]:
series = pd.Series(['하나', '둘', '셋', '넷', '다섯', '여섯', '일곱',' 여덟', '아홉', '열'], index = [_ for _ in range(1,11)])
series

## object 객체는 최상위의 객체, 모든 걸 포괄할 수 있는 객체

1      하나
2       둘
3       셋
4       넷
5      다섯
6      여섯
7      일곱
8      여덟
9      아홉
10      열
dtype: object

In [22]:
s = pd.Series([9_904_312, 3_448_737, 2_890_451, 2_466_052], index = ['서울', '부산', '인천', '대구'])
s.index
s.values

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [23]:
s.name = "인구"
s.index.name = "도시"

In [24]:
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [26]:
dict = {'a' : 1, 'b' : 2, 'c' : 3}
ser = pd.Series(data = dict, index = ['x','y','z'])
ser

x   NaN
y   NaN
z   NaN
dtype: float64

In [27]:
s2 = pd.Series({'서울' : 9_904_312,
                '부산' : 3_448_737,
                '인천' : 2_890_451,
                '대구' : 2_466_052})
s2

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [29]:
s = pd.Series([99040312, 3448737, 2890452, 2466052], index = ['서울','부산','인천','대구'])

In [32]:
s - s2

서울    89136000
부산           0
인천           1
대구           0
dtype: int64

In [34]:
rs = pd.Series([1.636984, 2.832690, 9.818107], index = ['부산','서울','인천'])
rs['부산'] = 1.63
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

In [38]:
rs['대구'] = 1.41
rs

부산    1.630000
서울    2.832690
인천    9.818107
대구    1.410000
dtype: float64

In [39]:
del rs['서울']
rs

부산    1.630000
인천    9.818107
대구    1.410000
dtype: float64

In [40]:
fin1 = {'카카오':60010, '삼성전자':61000, 'LG전자':90000}
fin2_value = [60200, 61200, 200100]
fin2_index = ['카카오','삼성전자','네이버']

ser_finance1 = pd.Series(fin1)
ser_finance2 = pd.Series(fin2_value, index = fin2_index)

In [48]:
result = ser_finance1 - ser_finance2
result[result.notnull()]

삼성전자   -200.0
카카오    -190.0
dtype: float64

In [44]:
ser_finance1 + ser_finance2

LG전자         NaN
네이버          NaN
삼성전자    122200.0
카카오     120210.0
dtype: float64

In [45]:
ser_finance1 * ser_finance2

LG전자             NaN
네이버              NaN
삼성전자    3.733200e+09
카카오     3.612602e+09
dtype: float64

In [46]:
ser_finance1 / ser_finance2

LG전자         NaN
네이버          NaN
삼성전자    0.996732
카카오     0.996844
dtype: float64

In [49]:
d = {'col1' : [1,2], 'col2' : [3, 4]}
df = pd.DataFrame(data = d)
df

   col1  col2
0     1     3
1     2     4

In [50]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [65]:
dict_ = {'코스피' : ['하락', '하락', '상승', '상승', '하락'],
        '코스피 지수' : [2359.53, 2365.10, 2386.09, 2399.86, 2379.39],
        '두산에너빌리티' : [16400, 16900, 17150, 16500, 16300],
        '삼성전자' : [60500, 60500, 60800, 61100, 61000],
        '셀바스AI' : [8250, 7980, 8510, 8600, 8820],
        '레인보우로보틱스' : [53700, 49750, 54700, 56700, 63200],
        }
df = pd.DataFrame(dict_, index = ['2023.01.11', '2023.01.12', '2023.01.13', '2023.01.16', '2023.01.17'])
# df.columns.name = '주가'
# df.index.name = '날짜'
df

           코스피   코스피 지수  두산에너빌리티   삼성전자  셀바스AI  레인보우로보틱스
2023.01.11  하락  2359.53    16400  60500   8250     53700
2023.01.12  하락  2365.10    16900  60500   7980     49750
2023.01.13  상승  2386.09    17150  60800   8510     54700
2023.01.16  상승  2399.86    16500  61100   8600     56700
2023.01.17  하락  2379.39    16300  61000   8820     63200

In [97]:
df.head(1)

           코스피   코스피 지수  두산에너빌리티   삼성전자  셀바스AI  레인보우로보틱스
2023.01.11  하락  2359.53    16400  60500   8250     53700

In [99]:
df[:1]

           코스피   코스피 지수  두산에너빌리티   삼성전자  셀바스AI  레인보우로보틱스
2023.01.11  하락  2359.53    16400  60500   8250     53700

In [103]:
df[1:3]

           코스피   코스피 지수  두산에너빌리티   삼성전자  셀바스AI  레인보우로보틱스
2023.01.12  하락  2365.10    16900  60500   7980     49750
2023.01.13  상승  2386.09    17150  60800   8510     54700

In [104]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)

In [107]:
# 1번
df['수학']

# 2번
df[['국어','영어']]

# 3번
df['평균' ] = (df['국어'] + df['영어'] + df['수학']) / 3

# 4번
df['영어']['방자'] = 80
df['평균' ] = (df['국어'] + df['영어'] + df['수학']) / 3

# 5번
df['춘향':'춘향']

# 6번
df.T['향단']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [125]:
df.T['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

In [117]:
df

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  46.666667

In [137]:
np.random.seed(0)
pd.DataFrame(np.random.randn(6,4), index = pd.date_range("20130206", periods = 6), columns = ['A', 'B','C','D'])

                   A         B         C         D
2013-02-06  1.764052  0.400157  0.978738  2.240893
2013-02-07  1.867558 -0.977278  0.950088 -0.151357
2013-02-08 -0.103219  0.410599  0.144044  1.454274
2013-02-09  0.761038  0.121675  0.443863  0.333674
2013-02-10  1.494079 -0.205158  0.313068 -0.854096
2013-02-11 -2.552990  0.653619  0.864436 -0.742165

DatetimeIndex(['2013-02-06', '2013-02-07', '2013-02-08', '2013-02-09',
               '2013-02-10', '2013-02-11'],
              dtype='datetime64[ns]', freq='D')

In [321]:
class Team:
    count = 0
    order = []
    def __init__(self, number, name = None,  member = set()):
        self.number = number
        self.name = name
        self.__member = member
        Team.count += 1
        Team.order.append(number)
        
    def add_member(self, name):
        if name not in self.__member:
            self.__member.add(name)
            print(f'{name}님을 팀 {self.number}에 추가했습니다.')
        else:
            print(f'{name}님은 이미 팀에 있습니다.')
            
    def rm_member(self, name):
        if name in self.__member:
            self.__member.remove(name)
            print(f'{name}님을 팀에서 삭제했습니다.')
        else :
            print(f'{name}님은 해당 팀에 없습니다.')
            
    def get_count(self):
        return Team.count

    def get_order(self):
        return Team.order
    
    def set_order(self, x):
        if x in Team.order:
            Team.order.remove(x)
            Team.order.append(x)
        else :
            Team.order.append(x)
    
    def __len__(self):
        return len(self.__member)